In [2]:
import numpy as np
import pandas as pd

In [3]:
# 创建随机数生成器
rng = np.random.default_rng(seed=1234)

# 7.1 处理缺失值，哨兵值

In [4]:
float_data = pd.Series([1.2, -3.5, np.nan, 0])

float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [5]:
float_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
string_data = pd.Series(['aardvark', np.nan, None, 'avocado'])

string_data

0    aardvark
1         NaN
2        None
3     avocado
dtype: object

In [7]:
string_data.isna()

0    False
1     True
2     True
3    False
dtype: bool

In [8]:
float_data = pd.DataFrame(rng.standard_normal((3,3)), 
                          dtype='float64', 
                          columns=['a', 'b', 'c'])

float_data

          a         b         c
0 -1.603837  0.064100  0.740891
1  0.152619  0.863744  2.913099
2 -1.478823  0.945473 -1.666135

In [9]:
float_data.iloc[:2, 2] = np.nan
float_data.isna()

       a      b      c
0  False  False   True
1  False  False   True
2  False  False  False

In [10]:
float_data.loc[[0,2] , ['a', 'b']] = np.nan # loc() 根据标签索引
float_data.isna()

       a      b      c
0   True   True   True
1  False  False   True
2   True   True  False

## 过滤缺失值

In [11]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])

data.dropna() # 过滤缺失值

0    1.0
2    3.5
4    7.0
dtype: float64

In [12]:
data[data.notna()] # =data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [13]:
dataf = pd.DataFrame(rng.standard_normal((4,3)))
dataf.iloc[1:3, 1:] = np.nan
dataf.iloc[2:, 0] =np.nan
dataf

          0         1         2
0  0.343745 -0.512444  1.323759
1 -0.860280       NaN       NaN
2       NaN       NaN       NaN
3       NaN -1.002166  0.268346

In [14]:
dataf.dropna()

          0         1         2
0  0.343745 -0.512444  1.323759

In [15]:
dataf.dropna(how='all')
#    - `'any'` (默认)："零容忍"策略 - 确保每个保留的观测都是完整的
#   - `'all'`："最大限度保留"策略 - 只删除完全没有信息的行/列

          0         1         2
0  0.343745 -0.512444  1.323759
1 -0.860280       NaN       NaN
3       NaN -1.002166  0.268346

In [16]:
dataf[4] = np.nan
dataf

          0         1         2   4
0  0.343745 -0.512444  1.323759 NaN
1 -0.860280       NaN       NaN NaN
2       NaN       NaN       NaN NaN
3       NaN -1.002166  0.268346 NaN

In [17]:
dataf.dropna(axis='columns', how='all')

          0         1         2
0  0.343745 -0.512444  1.323759
1 -0.860280       NaN       NaN
2       NaN       NaN       NaN
3       NaN -1.002166  0.268346

In [18]:
df = pd.DataFrame(rng.standard_normal((7, 3)))
df.iloc[:4, 1] = np.nan
df.iloc[:2, 2] = np.nan

df

          0         1         2
0  0.767175       NaN       NaN
1  0.696279       NaN       NaN
2  0.013182       NaN -0.620532
3  1.331214       NaN -0.481484
4 -2.491790 -0.876564 -0.505509
5 -1.283129 -1.330328  0.825993
6 -0.247215 -1.699706 -1.335153

In [19]:
df.dropna()

          0         1         2
4 -2.491790 -0.876564 -0.505509
5 -1.283129 -1.330328  0.825993
6 -0.247215 -1.699706 -1.335153

In [20]:
df.dropna(thresh=2) # threshold = 2 设置一个阈值

          0         1         2
2  0.013182       NaN -0.620532
3  1.331214       NaN -0.481484
4 -2.491790 -0.876564 -0.505509
5 -1.283129 -1.330328  0.825993
6 -0.247215 -1.699706 -1.335153

## 补充缺失值

In [21]:
df.fillna(0)

          0         1         2
0  0.767175  0.000000  0.000000
1  0.696279  0.000000  0.000000
2  0.013182  0.000000 -0.620532
3  1.331214  0.000000 -0.481484
4 -2.491790 -0.876564 -0.505509
5 -1.283129 -1.330328  0.825993
6 -0.247215 -1.699706 -1.335153

用字典调用 `fillna` 时，你可以为每列使用不同的填充值：

In [22]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  0.767175  0.500000  0.000000
1  0.696279  0.500000  0.000000
2  0.013182  0.500000 -0.620532
3  1.331214  0.500000 -0.481484
4 -2.491790 -0.876564 -0.505509
5 -1.283129 -1.330328  0.825993
6 -0.247215 -1.699706 -1.335153

用于`.reindex()`的插值方法（见表 5.3）也可以用于 `fillna`：

In [23]:
df = pd.DataFrame(rng.standard_normal((6,3)))
df.iloc[2:, 1] = np.nan
df.iloc[4:, 2] = np.nan

df

          0         1         2
0 -0.299639  1.114807 -1.506409
1  1.590112 -0.487325 -1.711102
2  0.513090       NaN -0.221804
3  0.648817       NaN -0.010978
4  1.665417       NaN       NaN
5  2.799627       NaN       NaN

In [24]:
df.fillna(method='ffill') # 将过时

/var/folders/1m/2jsf455s4r7dx9t8l233n55c0000gp/T/ipykernel_21863/279806938.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill') # 将过时

          0         1         2
0 -0.299639  1.114807 -1.506409
1  1.590112 -0.487325 -1.711102
2  0.513090 -0.487325 -0.221804
3  0.648817 -0.487325 -0.010978
4  1.665417 -0.487325 -0.010978
5  2.799627 -0.487325 -0.010978

In [25]:
df.ffill()

          0         1         2
0 -0.299639  1.114807 -1.506409
1  1.590112 -0.487325 -1.711102
2  0.513090 -0.487325 -0.221804
3  0.648817 -0.487325 -0.010978
4  1.665417 -0.487325 -0.010978
5  2.799627 -0.487325 -0.010978

In [26]:
df.ffill(limit=1) # 填充数 = limit value

          0         1         2
0 -0.299639  1.114807 -1.506409
1  1.590112 -0.487325 -1.711102
2  0.513090 -0.487325 -0.221804
3  0.648817       NaN -0.010978
4  1.665417       NaN -0.010978
5  2.799627       NaN       NaN

In [27]:
print('dataframe 切片成 Series：')
print(df.median())
print(df.median().shape)
print('-------')
print('Series 按广播机制默认匹配 dataframe 的 colums => col1 = 1.458275， col2 = 1.247230')
print(df.fillna(df.median())) # 默认 axis =0

dataframe 切片成 Series：
0    1.119464
1    0.313741
2   -0.864106
dtype: float64
(3,)
-------
Series 按广播机制默认匹配 dataframe 的 colums => col1 = 1.458275， col2 = 1.247230
          0         1         2
0 -0.299639  1.114807 -1.506409
1  1.590112 -0.487325 -1.711102
2  0.513090  0.313741 -0.221804
3  0.648817  0.313741 -0.010978
4  1.665417  0.313741 -0.864106
5  2.799627  0.313741 -0.864106

In [28]:
print(df.median(axis=1))
print(df.median(axis=1).shape) # 压缩掉了 axis=1，剩下 shape （6， ）
print('-------')
print(df.fillna(df.median(axis=1), axis=0)) # 默认 axis=0 对齐，fillna 暂不支持 axis >0 高维运算

0   -0.299639
1   -0.487325
2    0.145643
3    0.318919
4    1.665417
5    2.799627
dtype: float64
(6,)
-------
          0         1         2
0 -0.299639  1.114807 -1.506409
1  1.590112 -0.487325 -1.711102
2  0.513090 -0.487325 -0.221804
3  0.648817 -0.487325 -0.010978
4  1.665417 -0.487325  0.145643
5  2.799627 -0.487325  0.145643

# 7.2 数据转换 data transformation

## 删除重复内容

In [29]:
data = pd.DataFrame({'k1': ['one', 'two']*3+['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})

data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [30]:
data.duplicated() 
# 因为row 5, 6 的 k1, k2 列相同

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [31]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [32]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [33]:
data.drop_duplicates(subset=['k1']) # 默认保留第一个观察到的值组合

    k1  k2  v1
0  one   1   0
1  two   1   1

In [34]:
data.drop_duplicates(subset=['k1'], keep='last') # keep="last" will return the last one

    k1  k2  v1
4  one   3   4
6  two   4   6

In [35]:
data.drop_duplicates(subset=['k1', 'k2'])

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5

## 使用函数或映射mapping转换数据

In [36]:
data = pd.DataFrame({"food": ["bacon", "pulled pork", "bacon",
                              "pastrami", "corned beef", "bacon",
                              "pastrami", "honey ham", "nova lox"],
                     "ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

### map修改值

In [ ]:
meat_to_animal = {
  "bacon": "pig",
  "pulled pork": "pig",
  "pastrami": "cow",
  "corned beef": "cow",
  "honey ham": "pig",
  "nova lox": "salmon"
}

data['animal'] = data['food'].map(meat_to_animal) # 修改值

data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

### map映射值

In [39]:
def get_animal(x):
    return meat_to_animal[x]

get_animal('bacon')

'pig'

In [40]:
data['food'].map(get_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [ ]:
data['food'].map(lambda x: meat_to_animal[x]) # lambda函数

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

## 替换值

In [42]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [55]:
print(data.replace(-999, np.nan))
print('-' * 10)
print(data.replace([-999, -1000], np.nan))
print('-' * 10)
print(data.replace([-999, -1000], [np.nan, 0])) # 分别替换两个不同值

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64
----------
0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64
----------
0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [ ]:
print(data.replace({-999: np.nan, -1_000: 0})) # 用 dict-like 语句传递参数
print('-' * 10)
print(f'data 值不变\n{data}\n.replace() 创建副本,不修改原视图')

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64
----------
data 值不变
0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64
.replace() 创建副本,不修改原视图

## 重命名轴标签

In [56]:
data = pd.DataFrame(np.arange(12).reshape((3,4)),
                    index=["Ohio", "Colorado", "New York"],
                    columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [ ]:
data.index.map(lambda x: x.upper())

Index(['OHIO', 'COLORADO', 'NEW YORK'], dtype='object')

In [58]:
def upper_func(x):
    return x.upper()

data.index.map(upper_func)

Index(['OHIO', 'COLORADO', 'NEW YORK'], dtype='object')

In [61]:
print(data)
print('data 原视图未改变')
print('-'*10)
data.index = data.index.map(upper_func)
print(data)
print('data.index 被修改')

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11
data 原视图未改变
----------
          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11
data.index 被修改

上述方法直接改变了 `data.index`

如果不想改变原视图就实现 rename，可以使用 `rename` 函数

In [65]:
data_rename = data.rename(index=str.title, columns=str.upper) # copy

data_rename

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

`rename` 省去了为 `index` `columns` 赋值的麻烦

In [66]:
data # with modifying the original

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

## 离散化与分箱 Discretization and Binning

连续数据通常会被离散化或以其他方式分成“箱 bins”进行分析。

In [67]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
age_categories = pd.cut(ages, bins)

age_categories

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [68]:
age_categories.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [69]:
age_categories.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [71]:
age_categories.value_counts()

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

在区间的字符串表示中，括号表示边是开的 （排他的），而方括号表示是闭的 （包含的）。

你可以通过传递 `right =False` 来改变哪一侧是闭合的：

In [72]:
pd.cut(ages, bins, right=False)

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64, left]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [73]:
group_names = ["Youth", "YoungAdult", "MiddleAged", "Senior"]

pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

如果你把整数个 bin 传递给 `pandas.cut` 而不是显式 bin 的边，它会根据数据中的最小值和最大值计算出等长 bin。

考虑一些均匀分布的数据被切成四分之一的情况：

In [ ]:
data = rng.uniform(size=20)
pd.cut(data, 4, precision=2) # 小数点显示精度，只影响显示，不影响计算
# 第一个bin的下界是数据的最小值，最后一个 bin 的上界是数据的最大值

[(0.74, 0.99], (0.74, 0.99], (0.005, 0.25], (0.5, 0.74], (0.5, 0.74], ..., (0.005, 0.25], (0.74, 0.99], (0.5, 0.74], (0.005, 0.25], (0.005, 0.25]]
Length: 20
Categories (4, interval[float64, right]): [(0.005, 0.25] < (0.25, 0.5] < (0.5, 0.74] < (0.74, 0.99]]